blogs/linux-program-exit-codes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-03 Fri 12:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux 程序退出码</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Linux 程序退出码</h1>
<p>
这通常不是问题。写程序时，正常退出 <code>exit(EXIT_SUCCESS)</code> ，其它情况 <code>exit(EXIT_FAILURE)</code> 。而检查程序退出码时，判断 <code>$?</code> 是否等于0即可。但当我们想通过不同的退出码，表示不同的错误原因时，就有必要了解退出码的一些约定，例如 <code>curl</code> 命令，退出码含义非常丰富。
</p>

<p>
在 <code>man 3 exit</code> 中，exit的参数是个 <code>int</code> ，这很容易给人错觉，退出码可以是任意整数，然而并非如此，退出码的范围是 <code>0-255</code> ，exit函数会把 <code>退出码 &amp; 0xff</code> 。
</p>

<p>
这里会再次给人以错觉，只要0-255的数字都可以，事实的确如此，然而却不是明智的选择，因为退出码多数都是要给bash使用的，而bash对错误码有自己的一套约定。
</p>

<div id="outline-container-orgdcbee2a" class="outline-2">
<h2 id="orgdcbee2a"><span class="section-number-2">1</span> Bash对错误码的约定</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">错误码</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">例子</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">通用错误</td>
<td class="org-left">let "var1 = 1/0"</td>
<td class="org-left">通用错误，例如除零和其它不允许的操作</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">shell内置命令误用</td>
<td class="org-left"><code>empty_function() {}</code></td>
<td class="org-left">缺少关键字或者命令或者权限问题</td>
</tr>

<tr>
<td class="org-right">126</td>
<td class="org-left">调用不可执行的命令</td>
<td class="org-left"><code>/dev/null</code></td>
<td class="org-left">权限问题或者命令不可执行</td>
</tr>

<tr>
<td class="org-right">127</td>
<td class="org-left">命令没找到</td>
<td class="org-left"><code>illegal_command</code></td>
<td class="org-left">命令不存在，或者 <code>$PATH</code> 配置问题</td>
</tr>

<tr>
<td class="org-right">128</td>
<td class="org-left">无效的exit参数</td>
<td class="org-left">exit 3.14159</td>
<td class="org-left">exit 只接受 0-255 范围的整数</td>
</tr>

<tr>
<td class="org-right">128+n</td>
<td class="org-left">收到信号n退出</td>
<td class="org-left">kill -9 $PPID</td>
<td class="org-left">$? 返回 137</td>
</tr>
</tbody>
</table>
<p>
以上参考 <a href="http://tldp.org/LDP/abs/html/exitcodes.html">原文</a> ，综上， <code>1-2，126-164</code> 是有特殊含义的退出码，用户在调用exit时，应该避免使用这些数字。
</p>

<p>
这些没有强制保证，仅从 <code>$? = 137</code> 无法确切判断是被kill了，还是 <code>exit 137</code> 退出了。
</p>
</div>
</div>

<div id="outline-container-orgc4330ec" class="outline-2">
<h2 id="orgc4330ec"><span class="section-number-2">2</span> wait对错误码的处理</h2>
<div class="outline-text-2" id="text-2">
<p>
下面是一个例子，正常退出status是正数，值是退出码，收到信号退出是负数，值是信号值，128表示超时。
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00;">int</span> <span style="color: #ffff00;">status</span> = 0;
<span style="color: #00ffff; font-weight: bold;">while</span> (<span style="color: #ff00ff;">true</span>) {
  <span style="color: #00ffff; font-weight: bold;">if</span> (waitpid(pid, &amp;status, 0) == -1) {
    kill(-pid, SIGKILL);
    waitpid(pid, &amp;status, 0);
    status = -128;
  } <span style="color: #00ffff; font-weight: bold;">else</span> {
    <span style="color: #00ffff; font-weight: bold;">if</span> (WIFEXITED(status)) {
      status = WEXITSTATUS(status);
    } <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span> (WIFSIGNALED(status)) {
      status = -WTERMSIG(status);
    } <span style="color: #00ffff; font-weight: bold;">else</span> <span style="color: #00ffff; font-weight: bold;">if</span> (WIFSTOPPED(status) || WIFCONTINUED(status)) {
      <span style="color: #00ffff; font-weight: bold;">continue</span>;
    } <span style="color: #00ffff; font-weight: bold;">else</span> {
      status = -128;
    }
  }
  <span style="color: #00ffff; font-weight: bold;">break</span>;
}
</pre>
</div>

<p>
wait得到的status值比 <code>$?</code> 丰富，借助宏能够获得详情，一些宏的定义如下：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0000ff; font-weight: bold;">#define</span> <span style="color: #0000ff; font-weight: bold;">__WTERMSIG</span>(<span style="color: #ffff00;">status</span>)      ((status) &amp; 0x7f)
<span style="color: #0000ff; font-weight: bold;">#define</span> <span style="color: #0000ff; font-weight: bold;">__WIFEXITED</span>(<span style="color: #ffff00;">status</span>)     (__WTERMSIG(status) == 0)
<span style="color: #0000ff; font-weight: bold;">#define</span> <span style="color: #0000ff; font-weight: bold;">__WEXITSTATUS</span>(<span style="color: #ffff00;">status</span>)   (((status) &amp; 0xff00) &gt;&gt; 8)
<span style="color: #0000ff; font-weight: bold;">#define</span> <span style="color: #0000ff; font-weight: bold;">__W_EXITCODE</span>(<span style="color: #ffff00;">ret</span>, <span style="color: #ffff00;">sig</span>)  ((ret) &lt;&lt; 8 | (sig))
</pre>
</div>
<p>
如上可以看出真正的退出码在第二个8位，和信号有关的在低8位。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2020-01-03 Fri 12:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
